kauailabs/navxmxp/stm32/navx-mxp/navx-mxp_hal.c
typedef struct {
	uint16_t data[ADC_NUM_CHANNELS];
} ADC_Samples;

#define MAX_NUM_ADC_SAMPLES 100
ADC_Samples adc_samples[MAX_NUM_ADC_SAMPLES];
int adc_enabled = 0;
#endif

/* Note:  ADC DMA is configured for 16-bit words.  The "Length" Parameter to HAL_ADC_Start_DMA */
/* below is the number of 16-bit words transferred - NOT the number of bytes.                  */

void HAL_IOCX_ADC_Enable(int enable)
{
#ifdef ENABLE_ADC
	if (enable) {
		if (adc_enabled == 0) {
			memset(&adc_samples,0, sizeof(adc_samples));
			HAL_StatusTypeDef status = HAL_ADC_Start_DMA(&hadc1,
					(uint32_t *)&adc_samples, sizeof(adc_samples) / sizeof(uint16_t));
			adc_enabled = ( status == HAL_OK ) ? 1 : 0;
		}
	} else {
		if (adc_enabled) {
			HAL_ADC_Stop_DMA(&hadc1);
			adc_enabled = 0;
		}
	}
#endif
}

void HAL_IOCX_ADC_Get_Samples( int start_channel, int n_channels, uint16_t* p_samples, uint8_t n_samples_to_average )
{
#ifdef ENABLE_ADC
	/* Range-check inputs */
	if ( n_samples_to_average > (sizeof(adc_samples)/sizeof(adc_samples[0]))) {
		n_samples_to_average = (sizeof(adc_samples)/sizeof(adc_samples[0]));
	}
	if (start_channel > (ADC_NUM_CHANNELS-1)) {
		return;
	}
	if ((start_channel + n_channels) > (ADC_NUM_CHANNELS-1)) {
		n_channels = ADC_NUM_CHANNELS - start_channel;
	}
	if (n_samples_to_average > MAX_NUM_ADC_SAMPLES ) {
		n_samples_to_average = MAX_NUM_ADC_SAMPLES;
	}
	/* Zero Accumulator */
	uint32_t accum[ADC_NUM_CHANNELS];
	int i, j;
	for ( i = 0; i < ADC_NUM_CHANNELS; i++ ) {
		accum[i] = 0;
	}
	/* Accumulate */
	for ( i = 0; i < n_samples_to_average; i++ ) {
		uint16_t *p_samples = &(adc_samples[i].data[start_channel]);
		for ( j = 0; j < n_channels; j++ ) {
			accum[j] += *p_samples++;
		}
	}
	/* Average */
	for ( i = 0; i < n_channels; i++ ) {
		p_samples[i] = accum[i] / n_samples_to_average;
	}
#endif
}

#define ADC_VOLTAGE_SAMPLES_TO_AVG 10
/* Returns 0 if 3.3V, non-zero of 5V VDA */
int HAL_IOCX_ADC_Voltage_5V( int n_samples_to_average )
{
#ifdef ENABLE_ADC
	if ( adc_enabled ) {
		uint16_t sample;
		HAL_IOCX_ADC_Get_Samples(ADC_CHANNEL_ANALOG_VOLTAGE_SWITCH, 1, &sample, ADC_VOLTAGE_SAMPLES_TO_AVG);
		return (sample > 3500) ? 1 : 0;
	} else {
		return 0;
	}
#else
    return 0;
#endif
}

#define ADC_EXT_POWER_SAMPLES_TO_AVG 10
const float vdiv_ratio = 3.24f / (11.5f + 3.24f);

float HAL_IOCX_Get_ExtPower_Voltage()
{
#ifdef ENABLE_ADC
	if ( adc_enabled ) {
		uint16_t sample;
		HAL_IOCX_ADC_Get_Samples(ADC_CHANNEL_EXT_POWER_VOLTAGE_DIV, 1, &sample, ADC_EXT_POWER_SAMPLES_TO_AVG);
		float ext_pwr_voltage = (((float)sample) / 4096) * 3.3f;
		ext_pwr_voltage *= (1.0f/vdiv_ratio);
		return ext_pwr_voltage;
	} else {
		return 0.0f;
	}
#else
    return 0.0f;
#endif
}

